import poster1 from '../assets/posters/movie1.png'
import poster2 from '../assets/posters/movie2.png'
import poster3 from '../assets/posters/movie3.png'
import poster4 from '../assets/posters/movie4.png'
import poster5 from '../assets/posters/movie5.png'
import poster6 from '../assets/posters/movie6.png'

export const movies = [
    {
        id: 1,
        title: "Аватар",
        originalTitle: "Avatar",
        year: 2009,
        genre: "Фантастика",
        rating: 8.0,
        poster: poster1,
        description: 'Парализованный морпех Джейк Салли отправляется на Пандору в составе научной миссии и получает второй шанс на движение в теле аватара — представителя народа на’ви. Но чем глубже он погружается в чужой мир, тем сложнее ему выбрать сторону в конфликте между людьми и местными жителями.',
    },
    {
        id: 2,
        title: "Дюна",
        originalTitle: "Dune",
        year: 2021,
        genre: "Фантастика",
        rating: 8.0,
        poster: poster2,
        description: 'Наследник древнего дома Атрейдесов Пол отправляется вместе с семьёй на Арракис — пустынную планету, единственный источник спайса во вселенной. Здесь ему предстоит столкнуться с предательством, политическими интригами и собственной судьбой.',
    },
    {
        id: 3,
        title: "Терминатор",
        originalTitle: "The Terminator",
        year: 1984,
        genre: "Фантастика",
        rating: 8.3,
        poster: poster3,
        description: 'Из будущего в Лос-Анджелес 1984 года прибывает кибернетический убийца T-800. Его цель — уничтожить Сару Коннор, мать будущего лидера сопротивления. Защитить её берётся солдат Кайл Рис, который знает о грядущей войне машин и людей не понаслышке.',
    },
    {
        id: 4,
        title: "Сумерки",
        originalTitle: "Twilight",
        year: 2008,
        genre: "Фэнтези",
        rating: 6.4,
        poster: poster4,
        description: 'Старшеклассница Белла Свон переезжает к отцу в дождливый городок Форкс и влюбляется в загадочного одноклассника Эдварда Каллена. Вскоре она узнаёт, что её избранник — вампир, а их чувствам угрожает не только клан сородичей, но и сама природа.',
    },
    {
        id: 5,
        title: "Оно",
        originalTitle: "It",
        year: 2017,
        genre: "Ужасы",
        rating: 7.4,
        poster: poster5,
        description: 'Семеро подростков из городка Дерри объединяются, чтобы противостоять древнему злу, которое пробуждается каждые 27 лет и принимает облик клоуна Пеннивайза. Каждому из них придётся встретиться лицом к лицу со своими страхами — и с тем, что скрывается под городом.',
    },
    {
        id: 6,
        title: "Человек-паук: Новый день",
        originalTitle: "Spider-man: Brand New Day",
        year: 2026,
        genre: "Фантастика",
        rating: 8.1,
        poster: poster6,
        description: 'Одинокий и повзрослевший Питер Паркер полностью посвящает себя борьбе с преступностью в Нью-Йорке, поскольку 4 года назад после заклинания Доктора Стренджа мир и все близкие забыли его. Но с ростом угроз и нагрузки на Человека-паука его способности претерпевают странные изменения, способные поставить под угрозу его существование.',
    },
]